dreplogle/EE-345M/boards/ek-lm3s8962/drivers/OS.c
  // Search the list and find the thread that points to the
  // one to be removed.
  while((searchPtr->next) != CurrentThread)
  {
    searchPtr = searchPtr->next;
  }

  // Do not kill the thread if it is the last element in the list
  if(CurrentThread->next != CurrentThread)
  {
    // Remove the current thread from the linked list by assigning
    // the pointer of the previous thread to the thread ahead of the
    // element to be removed. 
    searchPtr->next = CurrentThread->next;

    // Reassign the beginning of the list if removing first element 
    if(ThreadList == CurrentThread)
    {
      ThreadList = CurrentThread->next;
    }
	// Indicate to AddThread that this spot is open
    CurrentThread->id = DEAD;
  }

  OS_EXITCRITICAL();

  // Move on to the next thread
  TriggerPendSV();

  // Wait for the PendSV to take effect (very short)
  while(1);
}

//***********************************************************************
//
// OS_Id
//
//***********************************************************************
unsigned char
OS_Id(void)
{
  return CurrentThread->id;
}

//***********************************************************************
//
// OS_Fifo_Init
//
//***********************************************************************
void
OS_Fifo_Init(unsigned int size)
{
  long sr = 0;
  unsigned long timeIoff;
  OS_ENTERCRITICAL();

  PutPt = GetPt = &Fifo[0];
  FifoSize = size;
  OS_InitSemaphore(&fifoDataReady,0);
  

  OS_EXITCRITICAL();  
}

//***********************************************************************
//
// OS_Fifo_Get
//
//***********************************************************************
unsigned int
OS_Fifo_Get(unsigned long * dataPtr)
{
  if(PutPt == GetPt ){
    return FAIL;// Empty if PutPt=GetPt
  }
  else{
  OS_Wait(&fifoDataReady);
  *dataPtr = *(GetPt++);
    if(GetPt==&Fifo[FifoSize]){
      GetPt = &Fifo[0]; // wrap
    }
    return SUCCESS;
  }
}

//***********************************************************************
//
// OS_Fifo_Put
//
//***********************************************************************
unsigned int
OS_Fifo_Put(unsigned long data)
{
  dataType volatile *nextPutPt;
  nextPutPt = PutPt+1;
  if(nextPutPt ==&Fifo[FifoSize]){
    nextPutPt = &Fifo[0]; // wrap
  }
  if(nextPutPt == GetPt){
    return FAIL; // Failed, fifo full
  }
  else{
    *(PutPt) = data; // Put
    PutPt = nextPutPt; // Success, update
	OS_Signal(&fifoDataReady);
    return SUCCESS;
  }
}

//***********************************************************************
//
// OS_MailBox_Init
//
//***********************************************************************
void
OS_MailBox_Init(void)
{
  MailBox1 = 0;
}

//***********************************************************************
//
// OS_MailBox_Send
//
//***********************************************************************
void
OS_MailBox_Send(unsigned long data)
{
  MailBox1 = data;
}

//***********************************************************************
//
// OS_MailBox_Recv
//
//***********************************************************************
unsigned long
OS_MailBox_Recv(void)
{
  return MailBox1;
}

//***********************************************************************
//
// OS_MsTime
//
// \param none
//
// This function returns the current value of the SysTick timer used to 
// switch threads.
//
// \return counter value.
//
//***********************************************************************
unsigned long OS_Time(void)
{
  return TimerValueGet(TIMER1_BASE, TIMER_A);
}

//***********************************************************************
//
// OS_TimeDifference returns the time difference in usec.
//
//***********************************************************************
long OS_TimeDifference(unsigned long time1, unsigned long time2)
//                                   thisTime          	  LastTime
{
  if(time2 >= time1)
  {
  	return (long)(time2-time1);
  }
  else
  {
    return (long)(time2 + (MAX_TCNT-time1));      
  } 
}
//***********************************************************************
//
// OS_DebugProfileInit initializes GPIO port B pins 0 and 1 for time profiling
//
// \param none.
// \return none.
//
//***********************************************************************
void
OS_DebugProfileInit(void)
{
  SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOB);
  GPIOPinTypeGPIOOutput(GPIO_PORTB_BASE, GPIO_PIN_0 | GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_3);  
}

//***********************************************************************
//
// OS_DebugB0Set sets PortB0 to 1
//
// \param none.
// \return none.
//
//***********************************************************************
void
OS_DebugB0Set(void)
{
  GPIOPinWrite(GPIO_PORTB_BASE, GPIO_PIN_0, 1);
}
void
OS_DebugB1Set(void)
{
  GPIOPinWrite(GPIO_PORTB_BASE, GPIO_PIN_1, 1);
}

//***********************************************************************
//
// OS_DebugB0Clear sets PortB0 to 0
//
// \param none.
// \return none.
//
//***********************************************************************
void
OS_DebugB0Clear(void)
{
  GPIOPinWrite(GPIO_PORTB_BASE, GPIO_PIN_0, 0);
}
void
OS_DebugB1Clear(void)
{
  GPIOPinWrite(GPIO_PORTB_BASE, GPIO_PIN_1, 0);
}


//***********************************************************************
//
//  OS_InitSemaphore initializes semaphore within the OS to a given 
//  value.
//
// /param
//
//***********************************************************************

void 
OS_InitSemaphore(Sema4Type *semaPt, unsigned int value)
{
  long sr = 0;
  unsigned long timeIoff;
  OS_ENTERCRITICAL();

  (semaPt->value) = value;

  OS_EXITCRITICAL();
}

//***********************************************************************
//
//   OS_Signal signals a given semaphore.
//
//***********************************************************************

void 
OS_Signal(Sema4Type *semaPt)
{
  TCB * temp = ThreadList;  // pointer to all threads in the threadlist
  TCB * toUnblock = NULL;          // pointer to thread to unblock
  unsigned long highest_priority = 100; 
  long sr = 0;
  unsigned long timeIoff;
  OS_ENTERCRITICAL();
  (semaPt->value)++;
  if((semaPt->value) <= 0)
  {
     do
     {
       if(((temp->BlockPt) == semaPt) && (temp->priority < highest_priority)) 
       {
         toUnblock = temp;   // If a thread is blocked by this semaphore and 
                             // is the highest priority, unblock the thread
         highest_priority = toUnblock->priority;
       }
       temp = temp->next;
     }
     while(temp != ThreadList);
     if(toUnblock->BlockPt != NULL && toUnblock != NULL)
     {
       toUnblock->BlockPt = NULL;
     }
  }
  OS_EXITCRITICAL();
}

//***********************************************************************
//
//   OS_Wait waits for a given semaphore.
//
//***********************************************************************

void 
OS_Wait(Sema4Type *semaPt)
{
  long sr;
  unsigned long timeIoff;
  OS_ENTERCRITICAL();
  (semaPt->value)--;
  if((semaPt->value) < 0)
  {
     CurrentThread->BlockPt = semaPt;
     OS_Suspend();
  }
  OS_EXITCRITICAL();
}

//***********************************************************************
//
//   OS_bSignal signals binary semaphore. 
//
//***********************************************************************

void 
OS_bSignal(Sema4Type *semaPt)
{
  (semaPt->value) = 1;
}

//***********************************************************************
//
//   OS_bSignal waits for binary semaphore.
//
//***********************************************************************

void 
OS_bWait(Sema4Type *semaPt)
{
  IntMasterDisable();
  while((semaPt->value) == 0)
  {
  	IntMasterEnable();

  	IntMasterDisable();
  }
  (semaPt->value) = 0;
  IntMasterEnable();
}

//***********************************************************************
//
// PerThreadSwitchInit initializes the SysTick timer to interrupt at the 
// specified period to perform thread switching
//
// \param period is the period at which threads will be swtiched
// 
// \return SUCCESS if function was successful and FAIL if period 
// paramter is out of range.
//
//***********************************************************************
int 
PerThreadSwitchInit(unsigned long period)
{
  // Enable SysTick Interrupts
  SysTickIntEnable();

