dreplogle/EE-345M/boards/ek-lm3s8962/drivers/OS.c
  // Set the period in ms
  SysTickPeriodSet(period);

  // Set Systick priority to high, PendSV priority to low
  IntPrioritySet(FAULT_SYSTICK,(((unsigned char)0)<<5)&0xF0);
  IntPrioritySet(FAULT_PENDSV,(((unsigned char)7)<<5)&0xF0);
  
  // Enable the SysTick module  
  SysTickEnable();

  return SUCCESS;
}

//***********************************************************************
//
// Timer 3A Interrupt handler, executes the user defined period task.
//
//***********************************************************************
long timeCheck;
void
Timer3AIntHandler(void)
{
  int index;
  static unsigned long LastTime;  // time at previous interrupt  
  static unsigned long thisTime;         // time at current interrupt
  long jitter;                    // time between measured and expected

  thisTime = OS_Time();
  CumulativeRunTime += (OS_TimeDifference(thisTime, CumLastTime)*CLOCK_PERIOD)/1000;	//in ms
  CumLastTime = thisTime;

  if(EventIndex < NUM_EVENTS)
  {
    RunTimeProfile[EventIndex][0] = CumulativeRunTime;
    RunTimeProfile[EventIndex][1] = PER_THREAD_START;
	EventIndex++;
  }

  if(NumSamples < RUNLENGTH){
    // Jitter calculation:
    thisTime = OS_Time();       // current time, 20 ns
    timeCheck = OS_TimeDifference(thisTime, LastTime);
    jitter = ((OS_TimeDifference(thisTime, LastTime)-PeriodTimerA)*CLOCK_PERIOD)/1000;  // in usec
	if(!firstJitterA){
	  if(jitter > MaxJitterA){
        MaxJitterA = jitter;
      }
      if(jitter < MinJitterA){
        MinJitterA = jitter;
      }        // jitter should be 0
      index = jitter+JITTERSIZE/2;   // us units
      if(index<0)index = 0;
      if(index>=JitterSize)index = JITTERSIZE-1;
      JitterHistogramA[index]++; 
	}
	firstJitterA = 0;
  LastTime = thisTime;
  }
  // Execute the periodic thread
  TimerIntClear(TIMER3_BASE, TIMER_TIMA_TIMEOUT);
  PeriodicTaskA();
    
  thisTime = OS_Time();
  CumulativeRunTime += ((OS_TimeDifference(thisTime, CumLastTime)*CLOCK_PERIOD)/1000);	//in ms
  CumLastTime = thisTime;
  
  if(EventIndex < NUM_EVENTS)
  {
    RunTimeProfile[EventIndex][0] = CumulativeRunTime;
    RunTimeProfile[EventIndex][1] = PER_THREAD_END;
	EventIndex++;
  } 

}

//***********************************************************************
//
// Timer 3B Interrupt handler, executes the user defined period task.
//
//***********************************************************************
void
Timer3BIntHandler(void)
{
  static unsigned long LastTime;  // time at previous interrupt  
  static unsigned long thisTime;         // time at current interrupt 
  long jitter;                    // time between measured and expected
  int index;
 
  thisTime = OS_Time();
  CumulativeRunTime += ((OS_TimeDifference(thisTime, CumLastTime)*CLOCK_PERIOD)/1000);	//in ms
  CumLastTime = thisTime;
  
  if(EventIndex < NUM_EVENTS)
  {
    RunTimeProfile[EventIndex][0] = CumulativeRunTime;
    RunTimeProfile[EventIndex][1] = PER_THREAD_START;
	EventIndex++;
  }

  if(NumSamples < RUNLENGTH){
    // Jitter calculation:
    thisTime = OS_Time();       // current time, 20 ns
    timeCheck = OS_TimeDifference(thisTime, LastTime);
    jitter = ((OS_TimeDifference(thisTime, LastTime)-PeriodTimerB)*CLOCK_PERIOD)/1000;  // in usec
	if(!firstJitterB){
	  if(jitter > MaxJitterB){
        MaxJitterB = jitter;
      }
      if(jitter < MinJitterB){
        MinJitterB = jitter;
      }        // jitter should be 0
      index = jitter+JITTERSIZE/2;   // us units
      if(index<0)index = 0;
      if(index>=JitterSize)index = JITTERSIZE-1;
      JitterHistogramB[index]++; 
      LastTime = thisTime;
	}
	firstJitterB = 0;
  }
  // Execute Periodic task
  TimerIntClear(TIMER3_BASE, TIMER_TIMB_TIMEOUT);
  PeriodicTaskB();

  thisTime = OS_Time();
  CumulativeRunTime += ((OS_TimeDifference(thisTime, CumLastTime)*CLOCK_PERIOD)/1000);	//in ms
  CumLastTime = thisTime;
  
  if(EventIndex < NUM_EVENTS)
  {
    RunTimeProfile[EventIndex][0] = CumulativeRunTime;
    RunTimeProfile[EventIndex][1] = PER_THREAD_END;
	EventIndex++;
  }   
}

//***********************************************************************
//
// Timer 2A Interrupt handler, executes the user defined period task.
//
//***********************************************************************
void
Timer2IntHandler(void)
{

}

//***********************************************************************
//
// SysTick handler, enables PendSV for thread switching.
//
//***********************************************************************

void
SysTickThSwIntHandler(void)
{   
  unsigned long ulData, ulDelta, bumperData, bumperDelta; 
  long sr = 0;
  unsigned long timeIoff;
  static char count;
  OS_ENTERCRITICAL();
  CANIntDisable(CAN0_BASE, CAN_INT_MASTER | CAN_INT_ERROR);
//  if(g_sCAN.ulBytesRemaining !=0 && OS_Id() == 1)
//  {
//   OS_EXITCRITICAL();
//   return;
//   }
    //
    // Read the state of the push buttons.
    //
    ulData = (GPIOPinRead(GPIO_PORTE_BASE, (GPIO_PIN_0 | GPIO_PIN_1 |
                                            GPIO_PIN_2 | GPIO_PIN_3)) |
              (GPIOPinRead(GPIO_PORTF_BASE, GPIO_PIN_1) << 3)); 
	bumperData = (GPIOPinRead(GPIO_PORTB_BASE, (GPIO_PIN_0 | GPIO_PIN_1 |
                                            GPIO_PIN_2 | GPIO_PIN_3)) |
              GPIOPinRead(GPIO_PORTC_BASE, (GPIO_PIN_4 | GPIO_PIN_5 |
                                            GPIO_PIN_6 | GPIO_PIN_7)));    
   
    //
    // Determine the switches that are at a different state than the debounced
    // state.
    //
    ulDelta = ulData ^ g_ucSwitches;
	bumperDelta = bumperData ^ g_ucBumperSwitches;

    //
    // Increment the clocks by one.
    //
    g_ucSwitchClockA ^= g_ucSwitchClockB;
    g_ucSwitchClockB = ~g_ucSwitchClockB;

	g_ucBprSwitchClkA ^= g_ucBprSwitchClkB;
	g_ucBprSwitchClkB = ~g_ucBprSwitchClkB;

    //
    // Reset the clocks corresponding to switches that have not changed state.
    //
    g_ucSwitchClockA &= ulDelta;
    g_ucSwitchClockB &= ulDelta;

