dreplogle/EE-345M/boards/ek-lm3s8962/drivers/OS.c
	g_ucBprSwitchClkA &= bumperDelta;
	g_ucBprSwitchClkB &= bumperDelta;

    //
    // Get the new debounced switch state.
    //
    g_ucSwitches &= g_ucSwitchClockA | g_ucSwitchClockB;
    g_ucSwitches |= (~(g_ucSwitchClockA | g_ucSwitchClockB)) & ulData;

	g_ucBumperSwitches &= g_ucBprSwitchClkA | g_ucBprSwitchClkB;
	g_ucBumperSwitches |= (~(g_ucBprSwitchClkA | g_ucBprSwitchClkB)) & bumperData;

    //
    // Determine the switches that just changed debounced state.
    //
    ulDelta ^= (g_ucSwitchClockA | g_ucSwitchClockB);

	bumperDelta ^= (g_ucBprSwitchClkA | g_ucBprSwitchClkB); 

  
  //If the button is still pressed, execute the user task.
  if((ulDelta & 0x10) && !(g_ucSwitches & 0x10) && (ButtonTask != NULL))
  {
    ButtonTask();
  }
  if((ulDelta & 0x08) && !(g_ucSwitches & 0x08) && (RightTask != NULL))
  {
    RightTask();
  }
  if((ulDelta & 0x04) && !(g_ucSwitches & 0x04) && (LeftTask != NULL))
  {
    LeftTask();
  }
  if((ulDelta & 0x02) && !(g_ucSwitches & 0x02) && (DownTask != NULL))
  {
    DownTask();
  }
  if((ulDelta & 0x01) && !(g_ucSwitches & 0x01) && (UpTask != NULL))
  {
    UpTask();
  }                                    
  //Wait for the user to release the button
  //while(GPIOPinRead(GPIO_PORTF_BASE, GPIO_PIN_1));
  
  //Debounce for 10ms
  //SysCtlDelay((SysCtlClockGet()/1000)*10);

  //Re-read switch to make sure it is unpressed.
  //while(GPIOPinRead(GPIO_PORTF_BASE, GPIO_PIN_1));
                                            
  //Clear the interrupt
  /*GPIOPinIntClear(GPIO_PORTF_BASE, GPIO_PIN_1);
  GPIOPinIntClear(GPIO_PORTE_BASE, GPIO_PIN_1);
  GPIOPinIntClear(GPIO_PORTE_BASE, GPIO_PIN_1);
  GPIOPinIntClear(GPIO_PORTE_BASE, GPIO_PIN_1);
  GPIOPinIntClear(GPIO_PORTE_BASE, GPIO_PIN_1);   */


  //TimerIntClear(TIMER2_BASE, TIMER_TIMA_TIMEOUT);
  //GPIOPinIntEnable(GPIO_PORTF_BASE, GPIO_PIN_1);

  TriggerPendSV();

  OS_EXITCRITICAL();  
}

//***********************************************************************
//
// PendSV handler, switches threads.  Disables interrupts during execution.
//
//***********************************************************************
void 
PendSVHandler(void)
{
  TCB * TempPt;
  static unsigned long RunPriorityLevel;
  long sr;
  unsigned long timeIoff;
  static unsigned long thisTime;
  OS_ENTERCRITICAL();
  
  //Determine the priority level to run	and update sleeping threads
  RunPriorityLevel = 100;     //Initialize to rediculously low priority
  TempPt = ThreadList;
  do
  {
    // Find lowest active priority level
    if((TempPt->BlockPt == NULL)&&(TempPt->priority < RunPriorityLevel)&&(TempPt->sleepCount == 0))
	{
        RunPriorityLevel = TempPt->priority;
	}
	  // Decrement sleep counter on sleeping threads
    if(TempPt->sleepCount > 0)
	{
      (TempPt->sleepCount)--;
	}
	TempPt = TempPt->next;
  }while(TempPt != ThreadList);


  // Find the next thread that is not...
  // (1) Sleeping
  // (2) Blocked or
  // (3) Too low in priority
  NextThread = CurrentThread;
  do
  {
    NextThread = NextThread->next;
  }while(((NextThread->sleepCount != 0)||(NextThread->BlockPt != NULL)||(NextThread->priority > RunPriorityLevel))&&(NextThread!=CurrentThread));
  
  HWREG(NVIC_ST_CURRENT) = 0;

  thisTime = OS_Time();
  CumulativeRunTime += ((OS_TimeDifference(thisTime, CumLastTime)*CLOCK_PERIOD)/1000);	//in ms
  CumLastTime = thisTime;

  if(EventIndex < NUM_EVENTS)
  {
    RunTimeProfile[EventIndex][0] = CumulativeRunTime;
    RunTimeProfile[EventIndex][1] = FOREGROUND_THREAD_START;
	  EventIndex++;
  }
  OS_EXITCRITICAL();
 
  SwitchThreads();  
}

//***********************************************************************
//
// Select switch interrupt handler.  Executes task set by OS_AddButtonTask.
//
//***********************************************************************
void
SwitchIntHandler(void)
{

}
 
//******************************EOF**************************************